import 'package:flutter/material.dart';

class Consent extends StatelessWidget {
  const Consent({super.key});

  @override
  Widget build(BuildContext context) {
    return const Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
          'กรุณาอ่านข้อตกลงและเงื่อนไขฉบับนี้อย่างละเอียดก่อนการใช้งาน แอปพลิเคชัน หากทางแอปพลิเคชันตรวจสอบได้ว่ามีการละเมิด จะทำ การระงับบัญชีของท่าน เนื่องจากการใช้งานถือว่าท่านได้ยอมรับ และ ตกลงที่ จะปฏิบัติตามข้อตกลงต่อไปนี้ :',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w400),
        ),
        SizedBox(
          height: 16,
        ),
        Text(
          ' ** ข้อห้ามสำคัญ** ผู้ใช้งานต้องปฏิบัติตามกฎหมาย ว่าด้วยการ   คุ้มครองสัตว์ และกฎหมายอื่นที่เกี่ยวข้องทุกประการ และจำเป็นต้อง ตรวจสอบความพร้อมในการเลี้ยงดูสัตว์ของอีกฝ่ายด้วย**',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFFFF0000),
              fontWeight: FontWeight.w500),
        ),
        SizedBox(height: 16),
        Text(
          '1. ลักษณะการให้บริการ',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w600),
        ),
        Text(
          '   แอปพลิเคชันนี้ทำหน้าที่เป็น สื่อกลาง สำหรับการ:\n'
          '   - หน้านำไปให้สัตว์เลี้ยง หรือสัตว์รอรับเลี้ยง\n'
          '   - การให้ข้อมูลข่าวสารเกี่ยวกับสัตว์เลี้ยงและกฎหมายที่เกี่ยวข้อง\n'
          '   - ให้บริการสำหรับหน่วยงานที่มีภารกิจเกี่ยวกับสัตว์เลี้ยง\n',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w400),
        ),
        Text(
          '2. ความรับผิดชอบของผู้ใช้งาน',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w600),
        ),
        Text(
          '   - ข้อมูลที่ถูกต้องผู้ใช้บริการรับรองว่าข้อมูลทั้งปวงที่ให้ไว้ใน การลงทะเบียนและเป็นส่วนหนึ่งของบัญชีของตนเป็นข้อมูลที่ตรงตามความเป็นจริง ครบถ้วนและถูกต้อง และผู้ใช้บริการ จะแจ้งให้บริษัททราบทันทีถึงการเปลี่ยนแปลงข้อมูลดังกล่าวโดยทำการปรับปรุงข้อมูลในบัญชีของผู้ใช้บริการ\n'
          '   - ผู้ใช้งานต้องรับผิดชอบต่อข้อมูลที่ตนเองโพสต์หรือประกาศทั้งหมด\n'
          '   - การซื้อขายหรือมอบสัตว์เลี้ยงเป็นความรับผิดชอบโดยตรง ของผู้ใช้งานทั้งสองฝ่าย (ผู้ให้ และผู้รับหรือผู้ซื้อ และผู้ขาย)\n'
          '   - ผู้ใช้งานต้องปฏิบัติตามกฎหมายว่าด้วยการคุ้มครองสัตว์ และกฎหมายอื่นที่เกี่ยวข้องทุกประการ\n',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w400),
        ),
        Text(
          '3. ข้อจำกัดความรับผิดของแอปพลิเคชัน',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w600),
        ),
        Text(
          '   - แอปพลิเคชันเป็นเพียงสื่อกลางเท่านั้น มิได้มีส่วนร่วมในการครอบครอง หรือรับรองคุณภาพ ความปลอดภัย หรือความถูกต้องของสัตว์เลี้ยงที่มีการมอบหรือซื้อขาย\n'
          '   - ทางแอปพลิเคชันจะไม่รับผิดชอบต่อความเสียหาย หรือข้อพิพาทใด ๆ ที่เกิดจากการติดต่อหรือทำธุรกรรมระหว่างผู้ใช้งาน\n',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w400),
        ),
        Text(
          '4. การยินยอม',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w600),
        ),
        Text(
          '   โดยการใช้งานแอปพลิเคชันนี้ ท่านยินยอมให้ถือว่าท่านได้อ่าน เข้าใจและตกลงปฏิบัติตามข้อตกลงและเงื่อนไขทั้งหมดที่ระบุไว้ ข้างต้นทุกประการ',
          style: TextStyle(
              fontSize: 14,
              color: Color(0xFF242424),
              fontWeight: FontWeight.w400),
        ),
      ],
    );
  }
}
